app/Controllers/Auth.php

SELECT *
FROM `role`
WHERE `nom_role` = 'utilisateur'
 LIMIT 1
---
    protected function getDefaultRoleId(): int
    {
        $role = $this->roleModel->where('nom_role', 'utilisateur')->first();