app/Models/UserModel.php

    public function getUserByEmail(string $email): ?array
    {
        $user = $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'lucasrakotomily@gmail.com'
 LIMIT 1